ЯМБух.ЯндексМаршрутизация/src/Catalogs/ЯМ_ТранспортныеСредства/ЯМ_ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЯМ_ТранспортныеСредства</name>
  <attributes>
    <name>ЛогинКурьера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьФикс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаРейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартНеНаСкладе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершениеНеНаСкладе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаТочкиСтарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаТочкиСтарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаТочкиЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаТочкиЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПеремещения</name>
    <type>
      <types>EnumRef.ЯМ_СпособПеремещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаехатьНаСкладВНачалеМаршрута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаехатьНаСкладВКонцеМаршрута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеОкноТочкаСтарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеОкноТочкаОкончания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗавершения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтартаЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтартаЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.ЯМ_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Смены</name>
    <attributes>
      <name>ВременноеОкно</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаБалансировки</name>
      <type>
        <types>CatalogRef.ЯМ_ГруппыБалансировки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЖесткоеВременноеОкно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрафы</name>
      <type>
        <types>CatalogRef.ЯМ_НастройкиШтрафовДляАлгоритмов</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеКоличествоСтопов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеКоличествоСтопов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяПродолжительностьСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЯМБух.ЯндексМаршрутизация/src/Catalogs/ЯМ_СкладыОтгрузки/ЯМ_СкладыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЯМ_СкладыОтгрузки</name>
  <attributes>
    <name>Работает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеОкно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖесткоеВременноеОкно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрафы</name>
    <type>
      <types>CatalogRef.ЯМ_НастройкиШтрафовДляАлгоритмов</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияАдреса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисноеВремяВНачалеРейса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисноеВремяВКонцеРейса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГибкоеВремяСтарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЯМБух.ЯндексМаршрутизация/src/CommonModules/ЯМ_МониторингСервер/Module.bsl
Функция ПолучитьДанныеМашинДляМониторинга(Машина = Неопределено) Экспорт 
	
	Настройки = ЯМ_РаботаСНастройками.ПолучитьНастройкиМодуля();
	
	МассивДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЯМ_ТранспортныеСредства.Ссылка КАК Ссылка,
	|	"""" КАК company_id,
	|	ЯМ_ТранспортныеСредства.ЛогинКурьера КАК id,
	|	ЯМ_ТранспортныеСредства.Наименование КАК name,
	|	"""" КАК number,
	|	ЯМ_ТранспортныеСредства.НомерТелефона КАК phone,
	|	ЛОЖЬ КАК sms_enabled
	|ИЗ
	|	Справочник.ЯМ_ТранспортныеСредства КАК ЯМ_ТранспортныеСредства
	|ГДЕ
	|	ЯМ_ТранспортныеСредства.Работает
	|	И НЕ ЯМ_ТранспортныеСредства.ПометкаУдаления
	|	И ЯМ_ТранспортныеСредства.Ссылка = &Машина";
	Если Машина = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЯМ_ТранспортныеСредства.Ссылка = &Машина", "");
	Иначе
		Запрос.УстановитьПараметр("Машина", Машина);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		//СтруктураДанных = Новый Структура("company_id,id,name,number,phone,sms_enabled");
		СтруктураДанных = Новый Структура("company_id,name,number,phone,sms_enabled");
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		СтруктураДанных.number = Выборка.id;
		СтруктураДанных.company_id = Настройки.idКомпании;
		//СтруктураДанных.number = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

Функция ПолучитьДанныеСкладовДляМониторинга(Склад = Неопределено) Экспорт 
	
	МассивДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЯМ_СкладыОтгрузки.Ссылка КАК Ссылка,
	|	ЯМ_СкладыОтгрузки.Адрес КАК address,
	|	ЛОЖЬ КАК allow_route_editing,
	|	ЯМ_СкладыОтгрузки.Код КАК id,
	|	ЯМ_СкладыОтгрузки.Широта КАК lat,
	|	ЯМ_СкладыОтгрузки.Долгота КАК lon,
	|	100 КАК mark_route_started_radius,
	|	ЯМ_СкладыОтгрузки.Наименование КАК name,
	|	"""" КАК number,
	|	"""" КАК order_service_duration_s,
	|	"""" КАК service_duration_s,
	|	ЯМ_СкладыОтгрузки.ВременноеОкно КАК time_interval,
	|	""Europe/Moscow"" КАК time_zone
	|ИЗ
	|	Справочник.ЯМ_СкладыОтгрузки КАК ЯМ_СкладыОтгрузки
	|ГДЕ
	|	ЯМ_СкладыОтгрузки.Работает
	|	И НЕ ЯМ_СкладыОтгрузки.ПометкаУдаления
	|	И ЯМ_СкладыОтгрузки.Ссылка = &Склад";
	Если Склад = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЯМ_СкладыОтгрузки.Ссылка = &Склад", "");
	Иначе
		Запрос.УстановитьПараметр("Склад", Склад);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		// СтруктураДанных = Новый Структура("address,allow_route_editing,id,lat,lon,mark_route_started_radius,name,number,order_service_duration_s,service_duration_s,time_interval,time_zone");
		СтруктураДанных = Новый Структура("address,allow_route_editing,id,lat,lon,mark_route_started_radius,name,number,time_interval,time_zone");
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		СтруктураДанных.number = Строка(Выборка.id);
		//СтруктураДанных.number = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

Функция ПодготовитьJsonСтроку(Данные) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаJson = СтрЗаменить(ЗаписьJSON.Закрыть(),"\\","\");
	
	Возврат СтрокаJson;
КонецФункции

Функция ЗапросМониторинг(Метод,МассивДанных,Настройки) Экспорт
	Соединение = Новый HTTPСоединение("courier.yandex.ru",,,
			,Новый ИнтернетПрокси(Истина)
			,
			,Новый ЗащищенноеСоединениеOpenSSL);	
				
	// параметры подключения
	Адрес = "/api/v1/companies/" + Настройки.idКомпании + "/" + Метод;

	Запрос = Новый HTTPЗапрос(Адрес);
	Запрос.Заголовки.Вставить("Content-Type",	"application/json");
	Запрос.Заголовки.Вставить("Accept",			"application/json");
	Запрос.Заголовки.Вставить("Authorization",	"Auth " + Настройки.Токен_ЯндексМониторинг);
	
	// формирование запроса
	ТекстТелаЗапроса = ПодготовитьJsonСтроку(МассивДанных);
	Запрос.УстановитьТелоИзСтроки(ТекстТелаЗапроса);

	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",Ответ.КодСостояния);
	
	Возврат СтруктураОтвета;
КонецФункции
